Revit 2027 API
CurveByPointFailures Properties
The BuiltInFailures.CurveByPointFailures type exposes the following members.
Properties
Name | Description
UnableToGenerateCurve |  Unable to generate valid curve geometry from the driving points. The line by points will be dissolved.
Top
See Also
Reference
BuiltInFailures.CurveByPointFailures Class
Autodesk.Revit.DB Namespace